{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Masking", "config": {"mask_value": -1, "name": "masking_1", "batch_input_shape": [null, 3, 10], "trainable": true, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "bias_regularizer": null, "return_state": false, "recurrent_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "dtype": "float32", "name": "lstm_1", "dropout": 0.2, "implementation": 0, "go_backwards": false, "stateful": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "units": 32, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "recurrent_dropout": 0.0, "use_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "batch_input_shape": [null, 3, 10]}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "units": 6, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dtype": "float32", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 32], "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}