{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Masking", "config": {"mask_value": -1, "dtype": "float32", "batch_input_shape": [null, 3, 11], "name": "masking_1", "trainable": true}}, {"class_name": "LSTM", "config": {"activation": "tanh", "implementation": 0, "go_backwards": false, "bias_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 3, 11], "return_state": false, "dropout": 0.2, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "recurrent_regularizer": null, "units": 32, "unit_forget_bias": true, "unroll": false, "recurrent_dropout": 0.0, "trainable": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "recurrent_constraint": null, "name": "lstm_1", "stateful": false}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "units": 6, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "batch_input_shape": [null, 32], "dtype": "float32", "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "backend": "tensorflow"}