{"backend": "tensorflow", "keras_version": "2.0.8", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 3, 6], "mask_value": -1, "name": "masking_1", "dtype": "float32"}, "class_name": "Masking"}, {"config": {"use_bias": true, "recurrent_regularizer": null, "return_sequences": false, "trainable": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": false, "dtype": "float32", "bias_constraint": null, "implementation": 0, "name": "lstm_1", "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "return_state": false, "go_backwards": false, "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "dropout": 0.2, "batch_input_shape": [null, 3, 6], "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 32}, "class_name": "LSTM"}, {"config": {"use_bias": true, "activation": "linear", "activity_regularizer": null, "units": 4, "trainable": true, "batch_input_shape": [null, 32], "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}