{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 3, 24], "mask_value": -1, "trainable": true, "name": "masking_1", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "recurrent_dropout": 0.0, "return_sequences": false, "activity_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "units": 32, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "batch_input_shape": [null, 3, 24], "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_constraint": null, "name": "lstm_1", "dtype": "float32", "use_bias": true, "implementation": 0, "kernel_regularizer": null, "return_state": false, "go_backwards": false, "unit_forget_bias": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "units": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "batch_input_shape": [null, 32]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "keras_version": "2.0.8", "backend": "tensorflow"}