{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 3, 28], "mask_value": -1}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "return_state": false, "trainable": true, "return_sequences": false, "batch_input_shape": [null, 3, 28], "unit_forget_bias": true, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "tanh", "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "stateful": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "units": 32, "dropout": 0.2, "bias_regularizer": null, "bias_constraint": null, "go_backwards": false}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "batch_input_shape": [null, 32], "dtype": "float32", "kernel_constraint": null, "units": 14, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}